{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Деньги удвоятся через 12 лет\n"
     ]
    }
   ],
   "source": [
    "#Предположим, что мы положили деньги в банк под 6 процентов годовых. Через сколько лет деньги удвоятся? \n",
    "#Такую задачу сложно решить с помощью цикла for, однако с ней нам поможет  цикл while. \n",
    "#Цикл while («пока») позволяет выполнить одну и ту же последовательность действий, пока проверяемое условие истинно. \n",
    "#Условие записывается до тела цикла и проверяется до выполнения тела цикла. \n",
    "#Как правило, цикл while используется, когда невозможно определить точное значение количества проходов исполнения цикла.\n",
    "\n",
    "#Вернёмся к задаче и решим её с помощью цикла while:\n",
    "#Каждую итерацию цикла проверяется условие того, что money < 2. \n",
    "#Если условие выполняется, то выполняется и тело цикла, в котором к year прибавляется 1, а money умножается на 1.06 (+6%). \n",
    "#Как только мы получили удвоение денег, то есть money >= 2, цикл перестаёт выполняться, \n",
    "#и выполняется блок кода после else, который выводит нужное количество лет. \n",
    "\n",
    "money = 1\n",
    "year = 0\n",
    "yearly_multiplier = 1.06\n",
    "\n",
    "while money < 2:\n",
    "    money = money*yearly_multiplier\n",
    "    year += 1\n",
    "else:\n",
    "    print('Деньги удвоятся через', year, 'лет')\n",
    "\n",
    "#Output:\n",
    "#Деньги удвоятся через 12 лет "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#Синтаксис оператора while достаточно простой:\n",
    "\n",
    "#while условие:\n",
    "#    тело цикла\n",
    "#else:\n",
    "#    код, выполняющийся при завершении цикла. \n",
    "#В цикле while, как и в цикле for, можно применять операторы break и continue.\n",
    "\n",
    "#Несмотря на удобность для некоторых задач, цикл while таит в себе и опасность. \n",
    "#Если условие цикла while всегда выполняется (например, while True: ), то цикл не будет завершаться, \n",
    "#произойдёт \"зацикливание\". В таком случае тело цикла будет выполняться бесконечное количество раз. \n",
    "#Если мы этого не хотим, то можно использовать дополнительно счётчик, \n",
    "#который будет прерывать цикл при достаточно большом количестве итераций.\n",
    "\n",
    "#while 1: #Условие верно всегда\n",
    "#    print('Что хочу, то и делаю!')\n",
    "#    counter += 1\n",
    "#    if counter > 10000:\n",
    "#        break\n",
    "\n",
    "#В этом примере тело цикла будет выполняться до тех пор, пока счётчик не станет равен 10000, \n",
    "#после чего с помощью оператора break цикл будет прерван. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "19\n"
     ]
    }
   ],
   "source": [
    "#Задание 1\n",
    "\n",
    "#Клиент банка открыл вклад под 10% годовых и положил на этот счёт Y рублей. \n",
    "#Напишите программу, позволяющую определить, через сколько лет клиент будет иметь на счету сумму не менее Z рублей. \n",
    "#На вход программе идут два числа — Y, Z.\n",
    "#Для проверки используйте Y = 170000, Z = 1000000. \n",
    "#В результате работы программа должна вывести на экран число лет, которое потребуется для накопления требуемой суммы. \n",
    "#Ответ должен быть выведен на экран в виде целого числа без какого-либо дополнительного поясняющего текста.\n",
    "#Внимание: в процессе выполнения программы изменяйте переменную Y.\n",
    "\n",
    "Y = 170000\n",
    "Z = 1000000\n",
    "year=0\n",
    "while Y<Z:\n",
    "    Y=Y*1.1\n",
    "    year+=1\n",
    "else:\n",
    "    print(year)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Перевес 62 кг\n"
     ]
    }
   ],
   "source": [
    "#Задание 2\n",
    "\n",
    "#Пассажирский лифт имеет ограничение на перевозку: не более 400 кг единовременно. \n",
    "#Пусть на вход программе поступает вес (weight) входящих в лифт людей, а в случае, когда возникает перевес, \n",
    "#программа выдаёт предупреждение: \"Перевес N кг\". \n",
    "## КРЕТИНЫ. weight - вес КАЖДОГО ИЗ входящих в лифт людей\n",
    "#Например, при перевесе в 15 кг должно быть выведено сообщение: \"Перевес 15 кг\". \n",
    "#Обратите внимание, что в эталонной фразе не используются знаки препинания.\n",
    "#Для проверки используйте weight = 77 и не меняйте его по ходу цикла.\n",
    "\n",
    "weight = 77\n",
    "total=0\n",
    "while total<400:\n",
    "    total+=weight\n",
    "else:\n",
    "    print('Перевес',total-400,'кг')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "7\n"
     ]
    }
   ],
   "source": [
    "#Задание 3\n",
    "\n",
    "#Вы играете в компьютерную игру, дошли до схватки с финальным боссом, но вот беда: \n",
    "#ваш компьютер \"заглючил\", и вы не можете управлять персонажем в игре. \n",
    "#Босс атакует и каждую секунду наносит один удар, который отнимает у вас 80 единиц здоровья. \n",
    "#На схватку с боссом вы вышли с 500 единицами здоровья. \n",
    "#Создайте цикл, позволяющий понять, через сколько секунд босс вас убьет.\n",
    "#В результате работы программа должна вывести на экран число секунд, в течение которых будет длиться схватка. \n",
    "#Ответ должен быть выведен на экран в виде целого числа без какого-либо дополнительного поясняющего текста.\n",
    "#Для проверки используйте переменную current_health для сохранения текущего уровня здоровья и изменяйте её по ходу цикла, \n",
    "#и — переменную attack = 80 для хранения значения атаки Босса.\n",
    "\n",
    "current_health=500\n",
    "attack = 80\n",
    "ttl=0\n",
    "while current_health>0:\n",
    "    current_health-=80\n",
    "    ttl+=1\n",
    "else:\n",
    "    print(ttl)\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#Задание 4\n",
    "\n",
    "#На банковской карте хранятся 10 000 рублей. Хозяин карты написал программу, в которую вводит свои расходы (spent), \n",
    "#после чего программа показывает баланс (balance). \n",
    "#Баланс выводится в виде целого числа без каких-либо дополнительных сообщений. \n",
    "#Например, при остатке 3500 рублей на экран выводится число 3500. \n",
    "#Когда сумма средств на карте становится ниже нуля, программа выводит сообщение: \"Слишком большие расходы\".\n",
    "#Напишите программу, которая выводит на экран начальный баланс карты (число 10000), \n",
    "#баланс после каждого списания и сообщение \"Слишком большие расходы\" при достижении отрицательного баланса.\n",
    "#Для проверки используйте переменную spent = 2800 и НЕ меняйте её по ходу цикла. \n",
    "#Переменная balance должна меняться после каждого шага цикла.\n",
    "\n",
    "spent = 2800"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
